from dotenv import load_dotenv
from langchain_core.prompts import PromptTemplate
from langchain_ollama import ChatOllama
from langchain_openai import ChatOpenAI
import os
load_dotenv()


def main():

    information = """
    Ο Ίλον Μασκ (αναφέρεται συχνά και ως Έλον Μασκ), πλήρες όνομα Ίλον Ριβ Μασκ (Elon Reeve Musk), (Πρετόρια, 28 Ιουνίου 1971) είναι επιχειρηματίας, μηχανικός και εφευρέτης νοτιοαφρικανικής καταγωγής καθώς και ο πρώτος και μοναδικός τρισεκατομμυριούχος στον κόσμο .[30][31][32][33][34][35] Από τον Ιανουάριο του 2025 μέχρι τον Μάιο του 2025 ήταν επικεφαλής του Τμήματος Κυβερνητικής Αποτελεσματικότητας των ΗΠΑ (DOGE), με απόφαση του προέδρου των ΗΠΑ, Ντόναλντ Τραμπ.
    
    Ο Μασκ είναι ο γενικός διευθυντής και επικεφαλής τεχνολογικής ανάπτυξης για την εταιρεία διαστημικής τεχνολογίας SpaceX, της οποίας είναι επίσης ο ιδρυτής, καθώς και ο γενικός Διευθυντής και επικεφαλής τεχνολογικού σχεδιασμού της εταιρείας κατασκευής αυτοκινήτων και ενεργειακών συστημάτων Tesla, Inc. (πρώην Tesla Motors), και πρόεδρος της εταιρείας φωτοβολταϊκών συστημάτων SolarCity. Είναι επίσης ιδρυτής της εταιρείας Neuralink, που διερευνά τη συμβίωση ανθρώπου-τεχνητής νοημοσύνης, καθώς και της εταιρείας συστημάτων διάνοιξης σηράγγων The Boring Company, ενώ ξεκίνησε την επιχειρηματική του καριέρα ως συνιδρυτής των εταιριών Zip2 και PayPal.[36][37][38] Ανάμεσα στις διάφορες δραστηριότητες του, έχει επίσης οραματιστεί ένα σύστημα μεταφοράς υψηλής ταχύτητας με την ονομασία Hyperloop, έχει προτείνει ένα υπερηχητικό αεροσκάφος με ηλεκτρική προώθηση, καθώς επίσης είναι και ένας από τους πιο θερμούς υποστηρικτές της εξερεύνησης και αποίκισης του πλανήτη Άρη.[39]
    
    Στα μέσα Ιανουαρίου του 2021, ο Μασκ έγινε ο πλουσιότερος άνθρωπος στον πλανήτη, εκθρονίζοντας τoν διευθύνοντα σύμβουλο της Amazon Τζεφ Μπέζος. Η περιουσία του εκτιμάται ότι αγγίζει πλέον τα 203 δισ. δολάρια σύμφωνα με στοιχεία του Bloomberg’s Billionaires Index.[40][41] Τον Μάρτιο του 2020, η περιουσία του Μασκ είχε εκτιμηθεί περίπου στα 24,6 δις δολ.[42]
    
    Από τις 20 Ιανουαρίου 2025 είναι επικεφαλής του Τμήματος Κυβερνητικής Αποτελεσματικότητας των ΗΠΑ (DOGE) (Department of Government Efficiency-DOGE), μετά τη νέα ανάληψη προεδρικών καθηκόντων από τον Ντόναλντ Τραμπ. Ο Μασκ έγινε ενεργός στην αμερικανική πολιτική πριν από τις προεδρικές εκλογές των Ηνωμένων Πολιτειών του 2024, ως ένθερμος και οικονομικός υποστηρικτής του τότε υποψηφίου για την προεδρία Ντόναλντ Τραμπ και έγινε ο μεγαλύτερος πολιτικός δωρητής στις εκλογές. Αρχικά, θα ηγείτο μαζί με τον επιχειρηματία, Βιβέκ Ραμασουάμι, αλλά στη συνέχεια αναφέρθηκε ότι ο Ραμασουάμι απομακρύνθηκε από τον Μασκ και άλλα μέλη του κύκλου του Τραμπ. Ο Ίλον Μασκ είναι ο εφευρέτης της Tesla Motors ενώ ο Λέι Τζούν είναι ο εφευρέτης της Xiaomi Motors. [43]
    """

    summary_template = """
    given the information {information} about a person i want to create:
    1. A short summary
    2. Two interesting facts about them
    """

    summary_prompt_template = PromptTemplate(
        input_variables=["information"], template=summary_template
    )
    llm = ChatOpenAI(temperature=0, model="gpt-5")
    #llm = ChatOllama(temperature=0, model="gemma3:270m")
    chain = summary_prompt_template | llm
    response = chain.invoke(input={"information": information})
    print(response.content)




if __name__ == "__main__":
    main()
